export type Route = { from: string; to: string; price: string };

export const routes: Route[] = [
  { from: "Бендеры", to: "Тирасполь", price: "от 100р" },
  { from: "Бендеры", to: "Тирасполь (Б. Хутор)", price: "от 125р" },
  { from: "Бендеры", to: "Слободзея", price: "от 200р" },
  { from: "Бендеры", to: "Григориополь", price: "от 300р" },
  { from: "Бендеры", to: "Дубоссары", price: "от 400р" },
  { from: "Бендеры", to: "Рыбница", price: "от 800р" },
  { from: "Бендеры", to: "Каменка", price: "от 1100р" },
  { from: "Бендеры", to: "Кишинёв Аэропорт", price: "от 325р" },
  { from: "Бендеры", to: "Кишинёв Центр", price: "от 425р" },

  { from: "Тирасполь", to: "Новые Анены", price: "от 220р" },
  { from: "Тирасполь", to: "Каушаны", price: "от 190р" },
  { from: "Тирасполь", to: "Дубоссары", price: "от 450р" },
  { from: "Тирасполь", to: "Рыбница", price: "от 690р" },
  { from: "Тирасполь", to: "Каменка", price: "от 980р" },
  { from: "Тирасполь", to: "Паланка", price: "от 600р" },
  { from: "Тирасполь", to: "Бельцы", price: "от 1200р" },
  { from: "Тирасполь", to: "Криково", price: "от 390р" },

  { from: "Кишинёв (Центр)", to: "Тирасполь", price: "от 425р" },
  { from: "Кишинёв (Центр)", to: "Бендеры", price: "от 425р" },
  { from: "Кишинёв (Центр)", to: "Слободзея", price: "от 480р" },
  { from: "Кишинёв (Центр)", to: "Каларашевка", price: "от 2280р" },
  {
    from: "Кишинёв (Центр)",
    to: "Таможня у Ясс (без пересечения)",
    price: "от 1600р",
  },

  { from: "Кишинёв (Аэропорт)", to: "Бендеры", price: "от 325р" },
  { from: "Кишинёв (Аэропорт)", to: "Паланка", price: "от 980р" },
  { from: "Кишинёв (Аэропорт)", to: "Рыбница", price: "от 680р" },
  { from: "Кишинёв (Аэропорт)", to: "Бельцы", price: "от 980р" },
  { from: "Кишинёв (Аэропорт)", to: "Днестровск", price: "от 680р" },
  { from: "Кишинёв (Аэропорт)", to: "Первомайск", price: "от 680р" },
];

export const cities = Array.from(
  new Set(routes.flatMap((r) => [r.from, r.to]))
).sort();
