export type Route = { from: string; to: string; price: string };

export const routes: Route[] = [
  { from: "Бендеры", to: "Тирасполь", price: "от 100 лей" },
  { from: "Бендеры", to: "Тирасполь (Б. Хутор)", price: "от 125 лей" },
  { from: "Бендеры", to: "Слободзея", price: "от 200 лей" },
  { from: "Бендеры", to: "Григориополь", price: "от 300 лей" },
  { from: "Бендеры", to: "Дубоссары", price: "от 400 лей" },
  { from: "Бендеры", to: "Рыбница", price: "от 800 лей" },
  { from: "Бендеры", to: "Каменка", price: "от 1100 лей" },
  { from: "Бендеры", to: "Кишинёв Аэропорт", price: "от 325 лей" },
  { from: "Бендеры", to: "Кишинёв Центр", price: "от 425 лей" },

  { from: "Тирасполь", to: "Новые Анены", price: "от 220 лей" },
  { from: "Тирасполь", to: "Каушаны", price: "от 190 лей" },
  { from: "Тирасполь", to: "Дубоссары", price: "от 450 лей" },
  { from: "Тирасполь", to: "Рыбница", price: "от 690 лей" },
  { from: "Тирасполь", to: "Каменка", price: "от 980 лей" },
  { from: "Тирасполь", to: "Паланка", price: "от 600 лей" },
  { from: "Тирасполь", to: "Бельцы", price: "от 1200 лей" },
  { from: "Тирасполь", to: "Криково", price: "от 390 лей" },

  { from: "Кишинёв (Центр)", to: "Тирасполь", price: "от 425 лей" },
  { from: "Кишинёв (Центр)", to: "Бендеры", price: "от 425 лей" },
  { from: "Кишинёв (Центр)", to: "Слободзея", price: "от 480 лей" },
  { from: "Кишинёв (Центр)", to: "Каларашевка", price: "от 2280 лей" },
  {
    from: "Кишинёв (Центр)",
    to: "Таможня у Ясс (без пересечения)",
    price: "от 1600 лей",
  },

  { from: "Кишинёв (Аэропорт)", to: "Бендеры", price: "от 325 лей" },
  { from: "Кишинёв (Аэропорт)", to: "Паланка", price: "от 980 лей" },
  { from: "Кишинёв (Аэропорт)", to: "Рыбница", price: "от 680 лей" },
  { from: "Кишинёв (Аэропорт)", to: "Бельцы", price: "от 980 лей" },
  { from: "Кишинёв (Аэропорт)", to: "Днестровск", price: "от 680 лей" },
  { from: "Кишинёв (Аэропорт)", to: "Первомайск", price: "от 680 лей" },
];

export const cities = Array.from(
  new Set(routes.flatMap((r) => [r.from, r.to]))
).sort();

export const mdPmCities = Array.from(
  new Set(routes.flatMap((r) => [r.from, r.to]))
).sort();

export const uaCities = [
  "Одесса",
  "Киев",
  "Винница",
  "Львов",
  "Хмельницкий",
  "Тернополь",
  "Черновцы",
  "Умань",
  "Днепр",
  "Кривой Рог",
  "Полтава",
  "Житомир",
];
