"use client";
import React from "react";

const routes = [
  { from: "Бендеры", to: "Тирасполь", price: "100р" },
  { from: "Бендеры", to: "Тирасполь (Б. Хутор)", price: "125р" },
  { from: "Бендеры", to: "Слободзея", price: "200р" },
  { from: "Бендеры", to: "Григориополь", price: "300р" },
  { from: "Бендеры", to: "Дубоссары", price: "400р" },
  { from: "Бендеры", to: "Рыбница", price: "800р" },
  { from: "Бендеры", to: "Каменка", price: "1100р" },
  { from: "Бендеры", to: "Кишинёв Аэропорт", price: "325р" },
  { from: "Бендеры", to: "Кишинёв Центр", price: "425р" },

  { from: "Тирасполь", to: "Новые Анены", price: "от 220р" },
  { from: "Тирасполь", to: "Каушаны", price: "от 190р" },
  { from: "Тирасполь", to: "Дубоссары", price: "450р" },
  { from: "Тирасполь", to: "Рыбница", price: "от 690р" },
  { from: "Тирасполь", to: "Каменка", price: "980р" },
  { from: "Тирасполь", to: "Паланка", price: "от 600р" },
  { from: "Тирасполь", to: "Бельцы", price: "от 1200р" },
  { from: "Тирасполь", to: "Криково", price: "390р" },

  { from: "Кишинёв (Центр)", to: "Тирасполь", price: "от 425р" },
  { from: "Кишинёв (Центр)", to: "Бендеры", price: "425р" },
  { from: "Кишинёв (Центр)", to: "Слободзея", price: "от 480р" },
  { from: "Кишинёв (Центр)", to: "Каларашевка", price: "от 2280р" },
  {
    from: "Кишинёв (Центр)",
    to: "Таможня у Ясс (без пересечения)",
    price: "от 1600р",
  },

  { from: "Кишинёв (Аэропорт)", to: "Бендеры", price: "от 325р" },
  { from: "Кишинёв (Аэропорт)", to: "Паланка", price: "от 980р" },
  { from: "Кишинёв (Аэропорт)", to: "Рыбница", price: "от 680р" },
  { from: "Кишинёв (Аэропорт)", to: "Бельцы", price: "от 980р" },
  { from: "Кишинёв (Аэропорт)", to: "Днестровск", price: "от 680р" },
  { from: "Кишинёв (Аэропорт)", to: "Первомайск", price: "от 680р" },
];

const PriceList = () => {
  return (
    <div id="routes">
      <h2 className="pt-15 text-center text-black text-2xl font-black">
        {" "}
        Наши маршруты{" "}
      </h2>
      <p className="pl-[24px] pr-[24px] pt-5">
        🚖 Все маршруты InterTaxi доступны в обоих направлениях — как из города
        отправления в пункт назначения, так и обратно домой.
        <br />
        <br />
        🎫 При заказе обратной поездки в день приезда действует скидка 50%, если
        вы возвращаетесь: в свой родной город; или в любой соседний населённый
        пункт по пути следования.
        <br />
        <br />
        🌍 Наши маршруты охватывают ключевые города и аэропорты Молдовы и
        Приднестровья: Бендеры, Тирасполь, Слободзея, Григориополь, Дубоссары,
        Рыбница, Каменка, Кишинёв (центр и аэропорт), Бельцы, Каушаны, Новые
        Анены, Паланка.
        <br />
        <br />
        🕒 Мы обеспечиваем: удобное время отправления, включая ночные поездки;
        возможность выбрать количество пассажиров и заказать детское кресло;
        фиксированные цены без скрытых платежей; комфортные автомобили для
        междугородних поездок.
      </p>
      <div className="max-w-md mx-auto mt-6 border border-gray-300">
        <table className="w-full border-collapse text-black">
          <tbody>
            {routes.map((r, i) => (
              <tr key={i} className="  border-b border-gray-400">
                <td className="px-6 py-5">
                  {r.from} - {r.to}
                </td>
                <td className="px-4 py-3 text-right font-bold">{r.price}</td>
              </tr>
            ))}
          </tbody>
        </table>
      </div>
    </div>
  );
};

export default PriceList;
